leipoyanubloxAE/EVK-NINA-B1-mesh-demo/nRF5_SDK_15.2.0_9412b96/examples/iot/mqtt/lwip/subscriber/main.c
    // The list of IoT Timer clients is declared as a constant.
    static const iot_timer_clients_list_t iot_timer_clients =
    {
        (sizeof(list_of_clients) / sizeof(iot_timer_client_t)),
        &(list_of_clients[0]),
    };

    // Passing the list of clients to the IoT Timer module.
    err_code = iot_timer_client_list_set(&iot_timer_clients);
    APP_ERROR_CHECK(err_code);
#endif
    // Starting the app timer instance that is the tick source for the IoT Timer.
    err_code = app_timer_start(m_iot_timer_tick_src_id,
                               APP_TIMER_TICKS(IOT_TIMER_RESOLUTION_IN_MS),
                               NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the Event Scheduler initialization.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

/**@brief Function to handle interface up event. */
void nrf_driver_interface_up(iot_interface_t const * p_interface)
{
    UNUSED_PARAMETER(p_interface);

    NRF_LOG_INFO ("IPv6 Interface Up.");
    LEDS_ON(LED_ONE);

    sys_check_timeouts();
}


/**@brief Function to handle interface down event. */
void nrf_driver_interface_down(iot_interface_t const * p_interface)
{
    UNUSED_PARAMETER(p_interface);

    NRF_LOG_INFO ("IPv6 Interface Down.");
}

void app_mqtt_evt_handler(mqtt_client_t * const p_client, const mqtt_evt_t * p_evt)
{
    switch (p_evt->id)
    {
        case MQTT_EVT_CONNACK:
        {
            NRF_LOG_INFO (">> MQTT_EVT_CONNACK");
            if (p_evt->result == NRF_SUCCESS)
            {
                app_mqtt_subscribe();
                NRF_LOG_INFO (">> mqtt_subscribe");
                LEDS_OFF(LED_ONE);
                LEDS_ON(LED_TWO);
            }
            break;
        }
        case MQTT_EVT_PUBLISH:
        {
            NRF_LOG_INFO (">> Data length 0x%04lX", p_evt->param.publish.message.payload.bin_strlen);
            NRF_LOG_INFO (">> Topic length 0x%04lX", p_evt->param.publish.message.topic.topic.utf_strlen);

            if (p_evt->param.publish.message.payload.bin_strlen == 1)
            {
                // Accept binary or ASCII 0 and 1.
                if ((p_evt->param.publish.message.payload.p_bin_str[0] == 0) ||
                    (p_evt->param.publish.message.payload.p_bin_str[0] == 0x30))
                {
                    LEDS_OFF(LED_ONE);
                    #ifdef MESH_TEST
                    m_OnOff = false;
                    mesh_button_event_handler(0);
                    mesh_button_event_handler(2);
                    #endif
                }
                else if ((p_evt->param.publish.message.payload.p_bin_str[0] == 1) ||
                         (p_evt->param.publish.message.payload.p_bin_str[0] == 0x31))
                {
                    LEDS_ON(LED_ONE);
                    #ifdef MESH_TEST
                    m_OnOff = true;
                    mesh_button_event_handler(0);
                    mesh_button_event_handler(2);
                    #endif
                }
            }
            if (p_evt->param.publish.message.topic.qos == MQTT_QoS_1_ATLEAST_ONCE)
            {
                const mqtt_puback_param_t ack_param = {
                    .message_id = p_evt->param.publish.message_id
                };

                // Send acknowledgment.
                uint32_t err_code = mqtt_publish_ack(p_client, &ack_param);

                NRF_LOG_INFO (">> mqtt_publish_ack message id 0x%04x, result 0x%08lx",
                          p_evt->param.publish.message_id,
                          err_code);
                UNUSED_VARIABLE(err_code);
            }

            break;
        }
        case MQTT_EVT_DISCONNECT:
        {
            NRF_LOG_INFO (">> MQTT_EVT_DISCONNECT");
            LEDS_ON(LED_ONE);
            LEDS_OFF(LED_TWO);
            app_mqtt_connect();
            break;
        }
        default:
            break;
    }
}


/**@brief Function for starting connectable mode.
 */
static void connectable_mode_enter(void)
{
    uint32_t err_code = ipv6_medium_connectable_mode_enter(m_ipv6_medium.ipv6_medium_instance_id);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_INFO("Physical layer in connectable mode.");

}


static void on_ipv6_medium_evt(ipv6_medium_evt_t * p_ipv6_medium_evt)
{

}


static void on_ipv6_medium_error(ipv6_medium_error_t * p_ipv6_medium_error)
{
    // Do something.
}

/**@brief Function for initializing the nrf log module.
 */
static void sdk_log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}
#endif

#ifdef MESH_TEST
/**
 *------------------------------------------
 * Start of mesh app 
 *------------------------------------------
 */

#define APP_STATE_OFF                (0)
#define APP_STATE_ON                 (1)

#define APP_UNACK_MSG_REPEAT_COUNT   (2)

static generic_onoff_client_t m_clients[CLIENT_MODEL_INSTANCE_COUNT];
static bool                   m_device_provisioned;

/* Forward declaration */
static void app_gen_onoff_client_publish_interval_cb(access_model_handle_t handle, void * p_self);
static void app_generic_onoff_client_status_cb(const generic_onoff_client_t * p_self,
                                               const access_message_rx_meta_t * p_meta,
                                               const generic_onoff_status_params_t * p_in);
static void app_gen_onoff_client_transaction_status_cb(access_model_handle_t model_handle,
                                                       void * p_args,
                                                       access_reliable_status_t status);

const generic_onoff_client_callbacks_t client_cbs =
{
    .onoff_status_cb = app_generic_onoff_client_status_cb,
    .ack_transaction_status_cb = app_gen_onoff_client_transaction_status_cb,
    .periodic_publish_cb = app_gen_onoff_client_publish_interval_cb
};

static void device_identification_start_cb(uint8_t attention_duration_s)
{
#if 0
    hal_led_mask_set(LEDS_MASK, false);
    hal_led_blink_ms(BSP_LED_2_MASK  | BSP_LED_3_MASK,
                     LED_BLINK_ATTENTION_INTERVAL_MS,
                     LED_BLINK_ATTENTION_COUNT(attention_duration_s));
#endif
    NRF_LOG_INFO ("device_identification_start_cb");
    LEDS_OFF(LED_ONE);
    LEDS_OFF(LED_TWO);
    LEDS_ON(LED_ONE);
}

